{
    "mission":{
        "icon":"",
        "id":"M1",
        "title":"Unlocking Your Potential",
        "short":"'Unlocking Your Potential' is a cutting-edge program that empowers students to excel academically and seamlessly transition into successful careers. This initiative blends classroom education with practical application, guiding students to recognize and leverage their unique skill sets. Through interactive workshops, mentorship programs, and hands-on projects, participants learn to confidently navigate the job market. This is a transformative journey toward self-discovery and professional fulfillment, equipping students to thrive in the dynamic workforce. (straight from chatGPT!)",
        "long":"",
        "goals":[
        {
            "icon":"",
            "id":"GConf",
            "title":"Goal: Confidence",
            "short":"Graduates will feel confident that the Centre College education has a significant impact on their ability to find their first position.",
            "long":"",
            "slos":[
                {
                    "icon":"",
                    "id":"S Instrumental",
                    "title":"SLO: Instrumental",
                    "short":"Students will feel their Centre education is both relevant and instrumental in securing a wide range of jobs.",
                    "long":"",
                    "assessments":[
                        {
                            "icon":"",
                            "id":"A Instrumental",
                            "title":"Senior Survey",
                            "short":"We will assess student perspectives on their senior seminar",
                            "long":"",
                            "link":"slo1.1.html"
                        }
                    ]
                    
                },
                {
                    "icon":"",
                    "id":"S Ready",
                    "title":"SLO: Ready for the Future",
                    "short":"Students experience lower graduation and job-search anxiety compared to their peers.",
                    "long":"",
                    "assessments":[
                        {
                            "icon":"",
                            "id":"A Ready",
                            "title":"Decreased Visits",
                            "short":"The wellness center tracks the reason that students make counseling appointments.  We will see a decrease in wellness visits due to career or graduation anxiety this will be in relation to peer institutions as we expect these values to rise over time based on the population trends. ",
                            "long":"",
                            "link":"slo1.1.html"
                        }
                    ]
                    
                }
            ]


        },
        {
            "icon":"",
            "id":"G Skills",
            "title":"Goal: Leveraging the Liberal Arts",
            "short":"Student will leverage their liberal arts education to fuel their Career.",
            "long":"",
            "slos":[
                {
                    "icon":"",
                    "id":"S Skills",
                    "title":"SLO: Haz Skillz",
                    "short":"Students will identify and value the transferable skills the learn in the classroom.",
                    "long":"",
                    "assessments":[
                        {
                            "icon":"",
                            "id":"A Skills",
                            "title":"Classroom Assessment",
                            "short":"Pre and Post assessment will take place before each experiential (internship, global, artistic, mentor,community base) course.  Students will indicate what skills they learned, the size of that effect, as well as how that could be useful in the future.",
                            "long":"",
                            "link":"slo1.1.html"
                        }
                    ]
                },
                {
                    "icon":"",
                    "id":"S Application",
                    "title":"SLO: Application",
                    "short":"Students will be able to clearly articulate their skills when seeking employment.",
                    "long":"",
                    "assessments":[
                        {
                            "icon":"",
                            "id":"A Application",
                            "title":"Online Application",
                            "short":"Students will write an application to one of 3 non-major specific jobs.  They will be evaluated on how well they have leveraged their liberal arts education to get the job.",
                            "long":"",
                            "link":"slo1.1.html"
                        }
                    ]
                    
                }

            ]


        },
        {
            "icon":"",
            "id":"G Planning",
            "title":"Goal: Career Planning",
            "short":"Students will Understand and plan for future educational pursuits (graduate school, professional credentials, professional development, etc.)",
            "long":"",
            "slos":[
                {
                    "icon":"",
                    "id":"S Planning",
                    "title":"SLO: Planning",
                    "short":"Students will Understand and plan for future educational pursuits (graduate school, professional credentials, professional development, etc.)",
                    "long":"",
                    "assessments":[
                        {
                            "icon":"",
                            "id":"A Planning",
                            "title":"S.M.A.R.T.",
                            "short":"Students will present a SMART career plan upon graduation",
                            "long":"",
                            "link":"slo1.1.html"
                        }

                    ]
                    
                }

            ]


        }

        




        ]

    },
    "interventions":[
        {
            "icon":"./imgs/Check-list.svg",
            "id":"I Syllabus",
            "title":"Syllabus",
            "short":"Faculty will explicitly add soft skills to the syllabus.  This will cause faculty to reflect on how soft skills are delivered in the class and increase visibility of the work faculty are already doing.",
            "long":"",
            "slos":[
                {
                    "id":"S Skills",
                    "why":"Students will see the skills on the Syllabus and realize they are learning something?"
                },
                {
                    "id":"S Application",
                    "why":"After 40 classes where they are told they are learning stuff, students will remember and add it to their resume."
                },
                {
                    "id":"S Instrumental",
                    "why":"Students will realized they have learned the soft skills employeers are looking for and will be more satisfied."
                }
                ]
        },
        {
            "icon":"./imgs/brain.svg",
            "id":"I counseling",
            "title":"Counseling",
            "short":"Staff will offer programming to help Seniors transition from Centre College and build coping mechanisms for disappointments in the job search.",
            "long":"",
            "slos":[
                {
                    "id":"S Ready",
                    "why":"Preventative measures will not only decrease anxiety among our students before graduation, but also equip them for afterwards."
                },
                {
                    "id":"S Planning",
                    "why":"Preventative measures will help students differentiate between what they have control over, will must plan for, and what are realistic goals."
                }
                ]
        },
        {
            "icon":"./imgs/trophies-shelf.svg",
            "id":"I DataBase",
            "title":"Resume Database",
            "short":"Students will be invited to upload a resume and 3 cover letters.  Two for dream jobs, one for one of 3 generals jobs.  These profiles will be made available to trusted employers and part of a competition to select exceptional cover letters.",
            "long":"",
            "slos":[
                {
                    "id":"S Application",
                    "why":"As there is a direct chance of a job, students will put effort into writing the cover letters, seek out feedback to improve their performance."
                }
                ]
        },
        {
            "icon":"./imgs/bottled-bolt.svg",
            "id":"I Training",
            "title":"Staff Training",
            "short":"All employees with supervisory positions over students will learn to mentor SMART planning skills in relation to career planning.",
            "long":"",
            "slos":[
                {
                    "id":"S Planning",
                    "why":"This will empower faculty and staff to provide sound feedback on student career planning."
                }
                ]
        }

    ]
}
